def solution(n, w, num):
    answer = 0
    # w * 2 = 주기 (정방향 1 번 + 역방향 1번)
    # m1은 num의 순환 주기 내의 위치를 나타냄
    m1 = num%(w*2)
    """
    m2는 num의 순환 주기의 반대 위치를 나타냄 ex) w = 6, num = 3인경우 -> m1 = 3 % (6 * 2) = 3, m2 = ((6 * 2 + 1) - 3) % (6 * 2) = 10 % 12 = 10
     1  2  3  4  5  6
    12 11 10  9  8  7 
    위 예시처럼 3, 10이 같은 열에 위치함
    즉 m1은 지정한 번호의 상자가 놓인 행과 같은 방향의 상자들 중 지정한 번호와 같은 열에 놓인 상자들의 위치를
    m2는 반대방향의 상자 중 같은 열에 놓인 상자들의 위치를 나타낸 것
    """
    m2 = ((w*2+1) - m1)%(w*2)
    # 따라서 num ~ n까지의 수 중 주기 w * 2로 나눈 나머지가 m1 또는 m2이면 해당 상자 위에 놓인 상자라는 의미다.
    for i in range (num, n + 1) :
        if i % (w * 2) == m1 or i % (w * 2) == m2 :
            answer += 1
    return answer
